[
  {
    "id": 1376,
    "task": {
      "id": 1324,
      "text": "Базовые и производные типы данных. Иерархия определений типов данных и вложенности компонент переменных. Контекстный способ определения типа данных в Си. Абстрактный тип данных. Спецификация typedef.",
      "taskType": "QUESTION",
      "themeName": "Тип данных и переменная"
    },
    "number": 1,
    "ticketId": 1375,
    "status": "APPROVED",
    "rating": 1
  },
  {
    "id": 1377,
    "task": {
      "id": 1302,
      "text": "Время жизни и область действия переменных. Классификация. Определение и объявление переменных. Внешние, автоматические и статические переменные. Область действия функций. Внешние и статические функции.",
      "taskType": "QUESTION",
      "themeName": "Модульная организация программы"
    },
    "number": 2,
    "ticketId": 1375,
    "status": "REVISION"
  },
  {
    "id": 1378,
    "task": {
      "id": 1346,
      "text": "Статическое связывание. Библиотеки. Заголовочные файлы, их назначение и содержание. Файл проекта в классическом программировании.",
      "taskType": "QUESTION",
      "themeName": "Модульное программирование"
    },
    "number": 3,
    "ticketId": 1375,
    "status": "APPROVED",
    "rating": 2
  },
  {
    "id": 1379,
    "task": {
      "id": 1323,
      "text": "Указатель как элемент архитектуры компьютера. Синтаксис указателя в Си. Указатель и ссылка. Передача формальных параметров и результата по значению и по ссылке.",
      "taskType": "QUESTION",
      "themeName": "Указатели"
    },
    "number": 4,
    "ticketId": 1375,
    "status": "APPROVED",
    "rating": 1
  },
  {
    "id": 1380,
    "task": {
      "id": 1288,
      "text": "Указатели и массивы. Способы работы через указатель с массивом.",
      "taskType": "QUESTION",
      "themeName": "Адресная арифметика"
    },
    "number": 5,
    "ticketId": 1375,
    "status": "REJECTED",
    "rating": -2
  },
  {
    "id": 1381,
    "task": {
      "id": 1345,
      "text": "Динамические переменные и массивы. Операторы и функции управления динамической памятью.",
      "taskType": "QUESTION",
      "themeName": "Динамическая память"
    },
    "number": 6,
    "ticketId": 1375,
    "status": null
  },
  {
    "id": 1382,
    "task": {
      "id": 1325,
      "text": "Способы формирования массивов указателей - статические, динамические, смешанные. Работа с массивами указателей.",
      "taskType": "QUESTION",
      "themeName": "Массивы указателей"
    },
    "number": 7,
    "ticketId": 1375,
    "status": null
  },
  {
    "id": 1383,
    "task": {
      "id": 1347,
      "text": "Определение элемента списка. Способы формирования списков. Односвязные списки.   Двусвязные (циклические) списки.",
      "taskType": "QUESTION",
      "themeName": "Списки"
    },
    "number": 8,
    "ticketId": 1375,
    "status": "REJECTED",
    "rating": -2
  },
  {
    "id": 1384,
    "task": {
      "id": 1283,
      "text": "Рекурсивная структура данных и функция. Реализация рекурсивных функций, роль стека. Инвариант рекурсивной функции. Особенности разработки рекурсивных алгоритмов. Смысл локальных и глобальных переменных, формальных и фактических параметров в рекурсивной функции. Способы накопления результата.",
      "taskType": "QUESTION",
      "themeName": "Рекурсия"
    },
    "number": 9,
    "ticketId": 1375,
    "status": "CHECKING"
  },
  {
    "id": 1385,
    "task": {
      "id": 1322,
      "text": "Способы представления деревьев. Полный рекурсивный обход дерева (для всех способов представления).Алгоритмы, основанные на полном рекурсивном обходе дерева.",
      "taskType": "QUESTION",
      "themeName": "Деревья"
    },
    "number": 10,
    "ticketId": 1375,
    "status": "CHECKING"
  },
  {
    "id": 1386,
    "task": {
      "id": 1284,
      "text": "Его определение в языке и назначение. Указатель на функцию - формальный параметр. Динамическое связывание. Пример - численное интегрирование.",
      "taskType": "QUESTION",
      "themeName": "Указатель на функцию"
    },
    "number": 11,
    "ticketId": 1375,
    "status": "REJECTED",
    "rating": -2
  },
  {
    "id": 1387,
    "task": {
      "id": 1343,
      "text": "Двоичный и текстовый файл. Запись. Последовательный и произвольный доступ. Текстовый файл. Позиционирование в текстовом файле. Пример - создание \"закладок\" в файле.",
      "taskType": "QUESTION",
      "themeName": "Файл"
    },
    "number": 12,
    "ticketId": 1375,
    "status": "REJECTED",
    "rating": -2
  },
  {
    "id": 1388,
    "task": {
      "id": 1281,
      "text": "Понятие формата. Пример: сохранение и загрузка дерева в последовательный ДФ.",
      "taskType": "QUESTION",
      "themeName": "Последовательный двоичный файл"
    },
    "number": 13,
    "ticketId": 1375,
    "status": "REJECTED",
    "rating": -2
  },
  {
    "id": 1389,
    "task": {
      "id": 1349,
      "text": "Понятие записи и ключа. Линейный и двоичный поиск. Трудоемкость алгоритмов сортировки и поиска. Классификация сортировок: выбор, вставка, обмен, подсчет, разделение, слияние.",
      "taskType": "QUESTION",
      "themeName": "Сортировка и поиск"
    },
    "number": 14,
    "ticketId": 1375,
    "status": "REVISION"
  },
  {
    "id": 1390,
    "task": {
      "id": 1342,
      "text": "Способы представления деревьев. Полный рекурсивный обход, ветвление. Алгоритмы, основанные на полном рекурсивном обходе дерева. Эффективность алгоритмов на деревьях.",
      "taskType": "QUESTION",
      "themeName": "Деревья"
    },
    "number": 15,
    "ticketId": 1375,
    "status": "REVISION"
  },
  {
    "id": 1391,
    "task": {
      "id": 1289,
      "text": "Свойства и методы (функции) класса. Синтаксическое и технологическое определение класса. Технология ООП. Программирование от функции к функции и от класса к классу. \"Эпизодическое\" и \"тотальное\" ООП.",
      "taskType": "QUESTION",
      "themeName": "Определение класса и объекта"
    },
    "number": 16,
    "ticketId": 1375,
    "status": "CHECKING"
  },
  {
    "id": 1392,
    "task": {
      "id": 1321,
      "text": "Иерархия объектов. Базовый и производный классы. Наследование данных и методов. Наследование как основа программирования \"от класса к классу\". Объектно-ориентированные библиотеки, работа с ними с использованием наследования. Наследование. Способы наследования методов: полное наследование, перекрытие, частичное (условное) наследование. Конструирование объектов вложенных классов.",
      "taskType": "QUESTION",
      "themeName": "Наследование"
    },
    "number": 17,
    "ticketId": 1375,
    "status": "REVISION"
  },
  {
    "id": 1393,
    "task": {
      "id": 1341,
      "text": "Назначение закрытых и открытых данных и методов. Дружественность. Конструктор и деструктор. Глобальные, локальные и динамические объекты.",
      "taskType": "QUESTION",
      "themeName": "Закрытая и общая части класса"
    },
    "number": 18,
    "ticketId": 1375,
    "status": null
  },
  {
    "id": 1394,
    "task": {
      "id": 1287,
      "text": "Виртуальная функция как основа для создания интерфейсов. Абстрактные базовые классы. Виртуальная функция как элемент \"отложенного\" программирования.",
      "taskType": "QUESTION",
      "themeName": "Внешний и внутренний полиморфизм"
    },
    "number": 19,
    "ticketId": 1375,
    "status": "CHECKING"
  },
  {
    "id": 1395,
    "task": {
      "id": 1285,
      "text": "Параметры шаблонов. Примеры шаблонов структур данных: стек, очередь, список. Требования к объектам - параметрам шаблонов.",
      "taskType": "QUESTION",
      "themeName": "Шаблон как макроопределение класса"
    },
    "number": 20,
    "ticketId": 1375,
    "status": "REVISION"
  },
  {
    "id": 1396,
    "task": {
      "id": 1267,
      "text": "Задачу реализовать в виде функции, получающей все данные через параметры. Все структуры данных - динамические.\nЗамечания по выполняемым операциям. Объединение - результат содержит элементы из двух исходных структур данных (СД), элемент, присутствующий в обеих СД, включается в одном экземпляре. Пересечение - результат содержит элементы, одновременно присутствующие в обеих структурах данных. Разность - результат содержит элементы из первой СД, которые отсутствуют во второй.\nПересечение двух циклических списков.",
      "taskType": "EXERCISE",
      "themeName": "Двусвязные списки"
    },
    "number": 1,
    "ticketId": 1375,
    "status": "APPROVED",
    "rating": 17
  }
]